[Killed] ObjectLiteral
features/f3-result-screen/animations/resultAnimations.ts:4:41
 import { Variants } from 'framer-motion';
 
 // 결과 화면 Fade In 애니메이션
-export const resultVariants: Variants = {
-  initial: {
-    opacity: 0,
-    y: 20,
-  },
-  animate: {
-    opacity: 1,
-    y: 0,
-    transition: {
-      duration: 0.5,
-      ease: 'easeOut',
-    },
-  },
-  exit: {
-    opacity: 0,
-    y: -20,
-  },
-};
+export const resultVariants: Variants = {};
 
 // 신기록 축하 애니메이션 (Confetti 효과)
killedBy: Result Animations resultVariants initial 상태가 정의되어야 함
statusReason: expected undefined to be defined

[Killed] StringLiteral
features/f3-result-screen/animations/resultAnimations.ts:14:13
     y: 0,
     transition: {
       duration: 0.5,
-      ease: 'easeOut',
+      ease: "",
     },
   },
killedBy: Result Animations resultVariants animate transition ease가 "easeOut"이어야 함
statusReason: expected '' to be 'easeOut' // Object.is equality

[Killed] UnaryOperator
features/f3-result-screen/animations/resultAnimations.ts:19:8
   },
   exit: {
     opacity: 0,
-    y: -20,
+    y: +20,
   },
 };
killedBy: Result Animations resultVariants exit: y가 -20이어야 함 (위로 사라짐)
statusReason: expected 20 to be -20 // Object.is equality

[Killed] ObjectLiteral
features/f3-result-screen/animations/resultAnimations.ts:24:43
 };
 
 // 신기록 축하 애니메이션 (Confetti 효과)
-export const confettiVariants: Variants = {
-  initial: {
-    scale: 0,
-    opacity: 0,
-  },
-  animate: {
-    scale: 1,
-    opacity: 1,
-    transition: {
-      duration: 0.6,
-      ease: 'backOut',
-      delay: 0.2,
-    },
-  },
-};
+export const confettiVariants: Variants = {};
 
killedBy: Result Animations confettiVariants initial 상태가 정의되어야 함
statusReason: expected undefined to be defined
